[
  {
    "id": "1",
    "name": "Ham on Rye",
    "author": "Charles Bukowski",
    "image": "/images/book1.jpg",
    "genre": "Contemporary Literature",
    "about": "A semi-autobiographical novel by Charles Bukowski, it explores the harsh realities of growing up in a dysfunctional family during the Great Depression, following the protagonist, Henry Chinaski, through his painful and often brutal childhood."
  },
  {
    "id": "2",
    "name": "Of Mice and Men",
    "author": "John Steinbeck",
    "image": "/images/book2.jpg",
    "genre": "Classics",
    "about": "Set during the Great Depression, this classic novel by John Steinbeck tells the story of two displaced ranch workers, George and Lennie, who dream of owning their own land but face tragic obstacles along the way."
  },
  {
    "id": "3",
    "name": "Steppenwolf",
    "author": "Hermann Hesse",
    "image": "/images/book3.jpg",
    "genre": "Contemporary Literature",
    "about": "Hermann Hesse's psychological novel explores the inner conflict of Harry Haller, a reclusive intellectual torn between his humanity and his desire for self-destruction, ultimately leading him to a journey of self-discovery."
  },
  {
    "id": "4",
    "name": "White Nights",
    "author": "Fyodor Dostoevsky",
    "image": "/images/book4.jpg",
    "genre": "Contemporary Literature",
    "about": "In Fyodor Dostoevsky's novella, a lonely man wandering the streets of St. Petersburg encounters a young woman over four nights, leading to an emotional exploration of love, longing, and unfulfilled dreams."
  },
  {
    "id": "5",
    "name": "The Metamorphosis",
    "author": "Franz Kafka",
    "image": "/images/book5.jpg",
    "genre": "Classics",
    "about": "Franz Kafka's novella tells the story of Gregor Samsa, a traveling salesman who wakes up one morning to find himself transformed into a giant insect, exploring themes of alienation, identity, and the human condition."
  },
  {
    "id": "6",
    "name": "The Stranger",
    "author": "Albert Camus",
    "image": "/images/book6.jpg",
    "genre": "Contemporary Literature",
    "about": "Albert Camus' existential novel follows Meursault, an indifferent French Algerian who becomes embroiled in a senseless murder, highlighting themes of absurdism, existentialism, and the meaning of life."
  },
  {
    "id": "7",
    "name": "The Nick Adams Stories",
    "author": "Ernest Hemingway",
    "image": "/images/book7.jpg",
    "genre": "Contemporary Literature",
    "about": "A collection of short stories by Ernest Hemingway, it follows Nick Adams, a character loosely based on Hemingway himself, through his childhood, adolescence, and adult experiences, capturing the American experience."
  },
  {
    "id": "8",
    "name": "The Call of the Wild",
    "author": "Jack London",
    "image": "/images/book8.jpg",
    "genre": "Young Adult / Adventure",
    "about": "Jack London's adventure novel tells the story of Buck, a domesticated dog who is kidnapped and sold into the brutal life of an Alaskan sled dog, where he gradually reverts to his wild instincts to survive."
  },
  {
    "id": "9",
    "name": "The Colossus of Maroussi",
    "author": "Henry Miller",
    "image": "/images/book9.jpg",
    "genre": "Contemporary Literature",
    "about": "Henry Miller's travelogue details his journey through Greece in 1939, blending vivid descriptions of the Greek landscape with reflections on art, culture, and the meaning of life."
  },
  {
    "id": "10",
    "name": "1984",
    "author": "George Orwell",
    "image": "/images/book10.jpg",
    "genre": "Dystopia / Science Fiction",
    "about": "George Orwell's dystopian novel paints a chilling portrait of a totalitarian regime that exercises extreme control over its citizens, where independent thought is suppressed, and truth is manipulated."
  },
  {
    "id": "11",
    "name": "Brave New World",
    "author": "Aldous Huxley",
    "image": "/images/book11.jpg",
    "genre": "Dystopia / Science Fiction",
    "about": "Aldous Huxley's dystopian novel imagines a future society where technological advancements and social conditioning have eradicated individuality, leading to a seemingly perfect but ultimately dehumanizing world."
  },
  {
    "id": "12",
    "name": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "/images/book12.jpg",
    "genre": "Social and Racial Themes",
    "about": "Harper Lee's novel explores themes of racial injustice and moral growth in the American South during the 1930s, as seen through the eyes of young Scout Finch, whose father, Atticus, defends a black man accused of raping a white woman."
  },
  {
    "id": "13",
    "name": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "/images/book13.jpg",
    "genre": "Classics",
    "about": "F. Scott Fitzgerald's classic novel captures the decadence and excess of the Jazz Age, focusing on the mysterious Jay Gatsby and his unrequited love for Daisy Buchanan, set against the backdrop of 1920s America."
  },
  {
    "id": "14",
    "name": "Moby Dick",
    "author": "Herman Melville",
    "image": "/images/book14.jpg",
    "genre": "Classics",
    "about": "Herman Melville's epic novel follows Captain Ahab's obsessive quest to kill the white whale Moby Dick, exploring themes of revenge, fate, and the human struggle against nature."
  },
  {
    "id": "15",
    "name": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "/images/book15.jpg",
    "genre": "Classics",
    "about": "Jane Austen's beloved novel explores the complexities of love, marriage, and societal expectations in early 19th-century England, focusing on the relationship between Elizabeth Bennet and Mr. Darcy."
  },
  {
    "id": "16",
    "name": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "/images/book16.jpg",
    "genre": "Young Adult / Adventure",
    "about": "J.D. Salinger's novel follows the disillusioned teenager Holden Caulfield as he navigates the complexities of adolescence and the phoniness of the adult world, capturing the angst and alienation of youth."
  },
  {
    "id": "17",
    "name": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "/images/book17.jpg",
    "genre": "Young Adult / Adventure",
    "about": "J.R.R. Tolkien's fantasy novel tells the story of Bilbo Baggins, a reluctant hobbit who embarks on an epic adventure with a group of dwarves to reclaim their homeland from the dragon Smaug."
  },
  {
    "id": "18",
    "name": "Fahrenheit 451",
    "author": "Ray Bradbury",
    "image": "/images/book18.jpg",
    "genre": "Dystopia / Science Fiction",
    "about": "Ray Bradbury's dystopian novel depicts a future society where books are banned, and 'firemen' burn any that are found. The protagonist, Guy Montag, begins to question this practice, leading to a rebellion against the anti-intellectual society."
  },
  {
    "id": "19",
    "name": "Mrs. Dalloway",
    "author": "Virginia Woolf",
    "image": "/images/book19.jpg",
    "genre": "Classics",
    "about": "Virginia Woolf's novel chronicles a day in the life of Clarissa Dalloway, a high-society woman in post-World War I England, exploring themes of time, memory, and the complexities of the human mind."
  },
  {
    "id": "20",
    "name": "Slaughterhouse-Five",
    "author": "Kurt Vonnegut",
    "image": "/images/book20.jpg",
    "genre": "War and Conflicts",
    "about": "Kurt Vonnegut's anti-war novel follows Billy Pilgrim, a soldier who becomes “unstuck in time” and experiences events from his life, including his time as a prisoner of war during the bombing of Dresden, in a non-linear fashion."
  }
]
